Autodesk.Revit.DB.Architecture.HandRailPosition
The position of the hand rail.
Since:
2013

Autodesk.Revit.DB.Architecture.HandRailPosition.LeftAndRight
The handrail is on both sides of the railing.

Autodesk.Revit.DB.Architecture.HandRailPosition.Right
The hand rail is on the right side of railing.

Autodesk.Revit.DB.Architecture.HandRailPosition.Left
The hand rail is on the left side of railing.

Autodesk.Revit.DB.Architecture.HandRailPosition.None
No hand rail